using System;

//Есть аквариум, в котором плавают рыбы. В этом аквариуме может быть не больше определенного количества рыб.
// Рыб можно как добавить так и убрать из аквариума.(Программа должна быть в цикле для того чтоб рыбы могли жить.)
//Все рыбы отображаются списком, так же у рыб есть возраст. За 1 итерацию рыбы стареют на определенное количество жизней и могут умереть.
//Рыб так же вывести в консоль, чтоб можно было мониторить показатели.

// По итогу все не забыть вернуть в клас Program.cs

namespace HomeWork_6_9
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
