using System;
using System.Collections.Generic;
using System.Linq;

//Есть набор тушенки.У тушенки есть название, год производства и срок годности.
//Написать запрос для получения всех просроченных банок тушенки.
//Чтобы не заморачиваться, можете думать, что считаем только года, без месяцев. 

namespace HomeWork_7_5_DefinitionOfDelay
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
